/*************************** 城市级联 ****************************/
var id_province="#user_province";
var id_city="#user_city";
/**
 * 加载省份列表
 */
function province_load(province,city,province1,city1){
	//设置城市省份
	config_pc(province1,city1);
	//省份列表
	var provinceList=new Array('北京','安徽','福建','甘肃','广东','广西','贵州','海南','河北','河南','黑龙江','湖北','湖南','吉林','江苏','江西','辽宁','内蒙古','宁夏','青海','山东','山西','陕西','上海','四川','天津','西藏','新疆','云南','浙江','重庆','台湾','香港特别行政区','澳门特别行政区');

	//加载省份列表
	for ( var i = 0; i < provinceList.length; i++) {
		if(provinceList[i]==province){
			$(id_province).append('<option selected="selected">'+provinceList[i]+'</option>');
			city_load(provinceList[i],city);
			continue;
		}
		$(id_province).append('<option>'+provinceList[i]+'</option>');
	}
	if(province==null||province==""){
		city_load(provinceList[0]);
	}
}
/**
 * 设置城市省份
 */
function config_pc(province1,city1){
	if(province1!=null){
		id_province=province1;
	}
	if(city1!=null){
		id_city=city1;
	}
}
/**
 * 改变城市级联
 */
function change_city(province1,city1){
	//设置城市省份
	config_pc(province1,city1);
	//改变城市列表
	city_load($(id_province).val());
}
/**
 * 改变城市列表
 * @param province
 * @param city
 */
function city_load(province,city){
	$(id_city).empty();
	//城市列表
	var cityList=new Array();
	cityList["安徽"]=new Array('安庆','蚌埠','巢湖','池州','滁州','阜阳','合肥','淮北','淮南','黄山','六安','马鞍山','宿州','铜陵','芜湖','宣城','亳州');
	cityList["北京"]=new Array('北京');
	cityList["福建"]=new Array('福州','龙岩','南平','宁德','莆田','泉州','三明','厦门','漳州');
	cityList["甘肃"]=new Array('白银','定西','甘南藏族自治州','嘉峪关','金昌','酒泉','兰州','临夏回族自治州','陇南','平凉','庆阳','天水','武威','张掖');
	cityList["广东"]=new Array('潮州','东莞','佛山','广州','河源','惠州','江门','揭阳','茂名','梅州','清远','汕头','汕尾','韶关','深圳','阳江','云浮','湛江','肇庆','中山','珠海');
	cityList["广西"]=new Array('百色','北海','崇左','防城港','桂林','贵港','河池','贺州','来宾','柳州','南宁','钦州','梧州','玉林');
	cityList["贵州"]=new Array('安顺','毕节','贵阳','六盘水','黔东南苗族侗族自治州','黔南布依族苗族自治州','黔西南布依族苗族自治州','铜仁','遵义');
	cityList["海南"]=new Array('白沙黎族自治县','保亭黎族苗族自治县','昌江黎族自治县','澄迈县','定安县','东方','海口','乐东黎族自治县','临高县','陵水黎族自治县','琼海','琼中黎族苗族自治县','三亚','屯昌县','万宁','文昌','五指山','儋州');
	cityList["河北"]=new Array('保定','沧州','承德','邯郸','衡水','廊坊','秦皇岛','石家庄','唐山','邢台','张家口');
	cityList["河南"]=new Array('安阳','鹤壁','济源','焦作','开封','洛阳','南阳','平顶山','三门峡','商丘','新乡','信阳','许昌','郑州','周口','驻马店','漯河','濮阳');
	cityList["黑龙江"]=new Array('大庆','大兴安岭','哈尔滨','鹤岗','黑河','鸡西','佳木斯','牡丹江','七台河','齐齐哈尔','双鸭山','绥化','伊春');
	cityList["湖北"]=new Array('鄂州','恩施土家族苗族自治州','黄冈','黄石','荆门','荆州','潜江','神农架林区','十堰','随州','天门','武汉','仙桃','咸宁','襄樊','孝感','宜昌');
	cityList["湖南"]=new Array('常德','长沙','郴州','衡阳','怀化','娄底','邵阳','湘潭','湘西土家族苗族自治州','益阳','永州','岳阳','张家界','株洲');
	cityList["吉林"]=new Array('白城','白山','长春','吉林','辽源','四平','松原','通化','延边朝鲜族自治州');
	cityList["江苏"]=new Array('常州','淮安','连云港','南京','南通','苏州','宿迁','泰州','无锡','徐州','盐城','扬州','镇江');
	cityList["江西"]=new Array('抚州','赣州','吉安','景德镇','九江','南昌','萍乡','上饶','新余','宜春','鹰潭');
	cityList["辽宁"]=new Array('鞍山','本溪','朝阳','大连','丹东','抚顺','阜新','葫芦岛','锦州','辽阳','盘锦','沈阳','铁岭','营口');
	cityList["内蒙古"]=new Array('阿拉善盟','巴彦淖尔盟','包头','赤峰','鄂尔多斯','呼和浩特','呼伦贝尔','通辽','乌海','乌兰察布盟','锡林郭勒盟','兴安盟');
	cityList["宁夏"]=new Array('固原','石嘴山','吴忠','银川');
	cityList["青海"]=new Array('果洛藏族自治州','海北藏族自治州','海东','海南藏族自治州','海西蒙古族藏族自治州','黄南藏族自治州','西宁','玉树藏族自治州');
	cityList["山东"]=new Array('滨州','德州','东营','菏泽','济南','济宁','莱芜','聊城','临沂','青岛','日照','泰安','威海','潍坊','烟台','枣庄','淄博');
	cityList["山西"]=new Array('长治','大同','晋城','晋中','临汾','吕梁','朔州','太原','忻州','阳泉','运城');
	cityList["陕西"]=new Array('安康','宝鸡','汉中','商洛','铜川','渭南','西安','咸阳','延安','榆林');
	cityList["上海"]=new Array('上海');
	cityList["四川"]=new Array('阿坝藏族羌族自治州','巴中','成都','达州','德阳','甘孜藏族自治州','广安','广元','乐山','凉山彝族自治州','眉山','绵阳','南充','内江','攀枝花','遂宁','雅安','宜宾','资阳','自贡','泸州');
	cityList["天津"]=new Array('天津');
	cityList["西藏"]=new Array('阿里','昌都','拉萨','林芝','那曲','日喀则','山南');
	cityList["新疆"]=new Array('阿克苏','阿拉尔','巴音郭楞蒙古自治州','博尔塔拉蒙古自治州','昌吉回族自治州','哈密','和田','喀什','克拉玛依','克孜勒苏柯尔克孜自治州','石河子','图木舒克','吐鲁番','乌鲁木齐','五家渠','伊犁哈萨克自治州');
	cityList["云南"]=new Array('保山','楚雄彝族自治州','大理白族自治州','德宏傣族景颇族自治州','迪庆藏族自治州','红河哈尼族彝族自治州','昆明','丽江','临沧','怒江傈傈族自治州','曲靖','思茅','文山壮族苗族自治州','西双版纳傣族自治州','玉溪','昭通');
	cityList["浙江"]=new Array('杭州','湖州','嘉兴','金华','丽水','宁波','绍兴','台州','温州','舟山','衢州');
	cityList["重庆"]=new Array('重庆');
	cityList["台湾"]=new Array('台北','基隆','新竹','台中','嘉义','台南','宜兰','桃园','新竹苗栗','高雄','屏东','台东','花莲','澎湖');
	cityList["香港特别行政区"]=new Array('香港');
	cityList["澳门特别行政区"]=new Array('澳门');
	//加载城市列表
	for ( var i = 0; i < cityList[province].length; i++) {
		if(cityList[province][i]==city){
			$(id_city).append('<option selected="selected">'+cityList[province][i]+'</option>');
			continue;
		}
		$(id_city).append('<option>'+cityList[province][i]+'</option>');
	}
}
